app/controllers/posts_controller.rb

  def index
    @posts = Post.order(:created_at).page(params[:page]).per(30)
---
SELECT COUNT(*) FROM "posts"